app/Controllers/Artikel.php

    public function index()
    {
        $title = 'Daftar Warga';
        $model = new ArtikelModel();

        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';

        // Ambil query builder
        $builder = $model->getArtikelWithKategoriFiltered($q, $kategori_id);

        // Karena paginate() tidak bisa langsung dari builder, kita gunakan model untuk pagination
        $data['artikel'] = $builder->paginate(5);
        $data['pager'] = $model->pager;

        $data['title'] = $title;
        $data['q'] = $q;
        $data['kategori_id'] = $kategori_id;

        // Ambil semua kategori untuk dropdown
        $kategoriModel = new \App\Models\KategoriModel();
        $data['kategori'] = $kategoriModel->asArray()->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
 LIMIT 5
SELECT *
FROM `kategori`